In [2]:
import pandas as pd

data = {
    'Name' : ['Alice','Bob','Charlie'],
    'Age' : [25,30,35]
}

df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [3]:
df = pd.read_csv('data.csv')
df.head()

   ID     Name   Age  Gender         City   Salary  Experience
0   1     John  28.0    Male     New York  50000.0           3
1   2     Sara   NaN  Female  Los Angeles  52000.0           4
2   3    David  35.0    Male      Chicago      NaN           8
3   4    Linda  29.0  Female     New york  58000.0           5
4   5  Michael  41.0    Male        Miami  62000.0          10